---
kind: property
id: P:Autodesk.Revit.DB.HermiteSpline.Tangents
source: html/53da5165-723a-c36d-af2e-0fc56616e6e8.htm
---
# Autodesk.Revit.DB.HermiteSpline.Tangents Property

Returns the tangents of the Hermite spline.

## Syntax (C#)
```csharp
public IList<XYZ> Tangents { get; }
```